tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/constant/porous/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousToair
{
    type            interRegionHeatTransfer;

    interRegionHeatTransferCoeffs
    {
        nbrRegion       air;

        interpolationMethod cellVolumeWeight;
        master          true;

        semiImplicit    no;

        type            constant;

        htc             10;
        AoV             200;
    }
}


// ************************************************************************* //
